CSI API ETABS v1
eMatTypeSteel Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eMatTypeSteel
Public Enumeration eMatTypeSteel
Dim instance As eMatTypeSteel
public enum class eMatTypeSteel
type eMatTypeSteel
Members
Member name | Value | Description
ASTM_A36 | 1
ASTM_A53GrB | 2
ASTM_A500GrB_Fy42 | 3
ASTM_A500GrB_Fy46 | 4
ASTM_A572Gr50 | 5
ASTM_A913Gr50 | 6
ASTM_A992_Fy50 | 7
Chinese_Q235 | 8
Chinese_Q345 | 9
Indian_Fe250 | 10
Indian_Fe345 | 11
EN100252_S235 | 12
EN100252_S275 | 13
EN100252_S355 | 14
EN100252_S450 | 15
Chinese_Q355 | 16
See Also
Reference
ETABSv1 Namespace